		01 SearchSavingDetails.
			03 ALLTEL-MQ-HEADER.
			   05 ACC-NUMBER     		PIC x(20).
			   05 WITHDRAWAL-TYPE     	PIC x(48).
			   05 SERVICE-NAME			PIC x(48).
			   05 ACAI-CHANNEL			PIC X(4).
			   05 ACAI-USER-ID			PIC x(8).
			   05 ACAI-SESSION-ID		PIC X(113).