		01 SearchSavingDetails.
            03 ALLTEL-MQ-HEADER.
               05 ERROR_STATUS            PIC x(4).
               05 ERROR_MESSAGE           PIC x(4).
               05 ACAI-CHANNEL            PIC X(4).
               05 ACAI-SERVICE-NAME       PIC X(48).
               05 ACAI-USER-ID            PIC x(8).